"""
AbstractEventLoopPolicy - правила сколько создавать лупов, один глобальный или на каждый тред свой и тд.
Методы класса создают и возвращают лупы в соотв с правилами которые он определяет.
По дефолту (DefaultEventLoopPolicy) на каждый тред свой луп, но автоматически создаёт только для мейнтреда.
Также устанавливает/возвращает watcher для подпроцессов.

Экземпляр DefaultEventLoopPolicy == _UnixDefaultEventLoopPolicy (в глобальной переменной _event_loop_policy)
всегда один, даже если лупы созданы на каждый поток.

===================================================================================================
_loop_factory = _UnixSelectorEventLoop < BaseSelectorEventLoop < BaseEventLoop < AbstractEventLoop

Это монстр класс, который делает системные вызовы и проверяет дескрипторы на чтение и запись.
Связывает всё что можно в юниксе (юникс сокеты, пайпы, подпроцессы).
Создаёт Future (предок Task) и Task.

===================================================================================================
Future - This class is *almost* compatible with concurrent.futures.Future.
Task - A coroutine wrapped in a Future.

===================================================================================================


===================================================================================================
test server with:

# telnet 0.0.0.0 8888
# nc 0.0.0.0 8888
===================================================================================================

"""
